Patch "Show Frame Rate on Title Bar" in "System" by "Hyper & Sajid" 
//
    #lib "DeltaTime"
    #lib "Win32"

    using System.Diagnostics;
    using System.Runtime.InteropServices;
    using System.Text;
    using System.Threading;

    [DllImport("user32.dll", SetLastError = true, CharSet = CharSet.Auto)]
    static extern int GetWindowTextLength(IntPtr hWnd);

    [DllImport("user32.dll", SetLastError = true, CharSet = CharSet.Auto)]
    static extern int GetWindowText(IntPtr hWnd, StringBuilder lpString, int nMaxCount);

    [DllImport("user32.dll", SetLastError = true, CharSet = CharSet.Auto)]
    static extern bool SetWindowText(IntPtr hWnd, String lpString);

    static bool _isOriginalTitleCaptured = false;

    static string _originalTitle;
//
{
    new Thread
    (
        delegate()
        {
            while (true)
            {
                var windowHandle = Win32.GetGameWindowHandle();

                if (windowHandle == IntPtr.Zero)
                    continue;
                    
                if (!_isOriginalTitleCaptured)
                {
                    if (string.IsNullOrEmpty(_originalTitle))
                    {
                        var title = new StringBuilder(GetWindowTextLength(windowHandle) + 1);

                        GetWindowText(windowHandle, title, title.Capacity);

                        _originalTitle = title.ToString();
                    }
                    else
                    {

                mov    rax, {(long)pValue05}
                subss  xmm1, dword ptr [rax]
                mulss  xmm1, xmm0
                movaps xmm0, xmm2
                mulss  xmm0, xmm2
                mov    rax, {(long)pValue10}
                addss  xmm1, dword ptr [rax]
                mulss  xmm0, xmm2
                mulss  xmm1, xmm0
                mulss  xmm1, xmm3
                movss  dword ptr [rcx + 0x24], xmm1
                ret
            ",

            0x140131A90,

            HookBehavior.Replace
        );
    }
}
Patch "360 Degree Movement" in "Gameplay" by "Skyth" 
WriteNop(0x1404615B7, 4)



Code "Disable Boost Jump" in "Gameplay" by "Hyper" does "Disables jumping from a boost immediately starting air boost, retaining full jump height."
//
    #lib "Player"
//
{
    var pSonic = Player.GetSonicData();

    if (pSonic == null)
        return;
    
    if (Player.State.GetCurrentStateID<Sonic.StateID>(pSonic) != Sonic.StateID.StateBoostJump)
        return;
    
    Player.State.SetState<Sonic.StateID>(pSonic, Sonic.StateID.StateJump);
}
Code "Retrieve Boost from Rings" in "Gameplay" by "Hyper"
//
    #lib "GameManager"
    #lib "MathHelpers"

    #import "Blackboards"
    #import "Services"

    const float _boostMultiplier = 5.0f;

    static int _lastRingCount = 0;
//
{
    var pPlayerBlackboardService = GameManager.GetService<PlayerBlackboardService>();

    if (pPlayerBlackboardService == null)
        return;
        
    var pBlackboardBoost = pPlayerBlackboardService->GetBlackboardContent<BlackboardBoost>();

    if (pBlackboardBoost == null)
        return;

    var pBlackboardItem = pPlayerBlackboardService->GetBlackboardContent<BlackboardItem>();
    
    if (pBlackboardItem == null)
        return;

    int currentRings = pBlackboardItem->RingCount;
    
    if (currentRings <= 0)
        _lastRingCount = 0;

    if (_lastRingCount != currentRings && currentRings > 0)
    {
        pBlackboardBoost->BoostAmount = MathHelpers.Clamp
        (
            pBlackboardBoost->BoostAmount + (Math.Abs(currentRings - _lastRingCount) * _boostMultiplier),
            0.0f,
            120.0f
        );

        _lastRingCount = currentRings;
    }
}
Patch "Disable Timer" in "Cheats" by "CodenameGamma" 
WriteNop(0x14017EE5A, 5)



Library "GOComponents" by "Hyper"
{
    #include "Helpers" noemit

    #lib "GameObject"
    #lib "Helpers"
    #lib "Memory"

    #import "Collections"
    #import "Input"
    #import "Player"
    #import "PlayerCollision"
    #import "Plugins"
    #import "States"

    #load "System.Numerics.dll"
    
    using System.Numerics;
    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `hh::game::GOComponent`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x80)]
    public struct GOComponent
    {
        /// <summary>
        /// A pointer to an instance of `hh::game::GameObject` acting as the parent of this component.
        /// </summary>
        [FieldOffset(0x20)] public GameObject.Data* pParent;

        /// <summary>
        /// A pointer to an instance of `GOComponentStaticClass`.
        /// </summary>
        [FieldOffset(0x38)] public GOComponentStaticClass* pStaticClass;
    }

    /// <summary>
    /// A struct representation of the static class for storing information about a game object component.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct GOComponentStaticClass
    {
        /// <summary>
        /// The name of this game object component.
        /// </summary>
        [FieldOffset(0)] public Helpers.UnmanagedString Name;

        public override string ToString() => Name.ToString();
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x90, Pack = 0x20)]
    public struct GOCCamera
    {
        [FieldOffset(0)] public GOComponent Base;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x88, Pack = 0x20)]
    public struct GOCInput
    {
        [FieldOffset(0)]    public GOComponent Base;

        [FieldOffset(0x80)] public InputComponent* pInputComponent;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xE0, Pack = 0x20)]
    public struct GOCPlayerCollider
    {
        [FieldOffset(0)]    public GOComponent Base;

        [FieldOffset(0xC8)] public PlayerCollision.Data* pPlayerCollision;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x140, Pack = 0x20)]
    public struct GOCPlayerHsm
    {
        [FieldOffset(0)]     public GOComponent Base;

        [FieldOffset(0x78)]  public int CurrentStateID;

        [FieldOffset(0x90)]  public PlayerContext* pPlayerContext;

        [FieldOffset(0xC8)]  public void* pPlayerStateParameter;

        [FieldOffset(0xD0)]  public StatePluginManager* pStatePluginManager;

        [FieldOffset(0xEC)]  public int DestinationStateID;

        [FieldOffset(0xF4)]  public byte StateFlags;

        [FieldOffset(0x120)] public MoveArray<StateDesc> States;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x380, Pack = 0x20)]
    public struct GOCPlayerKinematicParams
    {
        [FieldOffset(0)]     public GOComponent Base;

        [FieldOffset(0xB0)]  public Vector3 Position;

        [FieldOffset(0xC0)]  public Quaternion Rotation;

        [FieldOffset(0xE0)]  public Vector3 Velocity;

        [FieldOffset(0x130)] public Vector3 WorldInput;

        [FieldOffset(0x1AC)] public bool IsGrounded;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x240, Pack = 0x20)]
    public struct GOCTransform
    {
        [FieldOffset(0)]    public GOComponent Base;

        [FieldOffset(0xC0)] public Vector3 Position;
    }
}
Library "Services" by "Hyper"
{
    #include "Helpers" noemit

    #lib "GameManager"
    #lib "Memory"

    #import "Blackboards"
    #import "Collections"
    #import "PlayerTargets"

    using System.Runtime.InteropServices;
    using System.Text;

    [StructLayout(LayoutKind.Explicit, Size = 0xB0, Pack = 0x20)]
    public struct LevelInfo
    {
        [FieldOffset(0)]    public GameService.Data Base;

        [FieldOffset(0x60)] public StageInfo.StageData* pStageData;

        [FieldOffset(0x70)] public void* pPlayerInformation;

        public static string GetCurrentStageID()
        {
            if (!Memory.TryGetPointer(GameManager.GetService<LevelInfo>(), out LevelInfo* out_pLevelInfo))
                return string.Empty;

            if (!Memory.TryGetPointer(out_pLevelInfo->pStageData, out StageInfo.StageData* out_pStageData))
                return string.Empty;

            return out_pStageData->ToString();
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA0)]
    public struct PlayerBlackboardService
    {
        [FieldOffset(0)]    public GameService.Data Base;

        [FieldOffset(0x60)] public ObjectMoveArray<Memory.Pointer<BlackboardContent>> Blackboards;

        [FieldOffset(0x80)] public Blackboard2* pBlackboard2;

        public BlackboardContent* GetBlackboardContent(string in_blackboardName)
        {
            foreach (var pBlackboard in Blackboards)
            {
                if (pBlackboard.pData->GetName()() == in_blackboardName)
                    return pBlackboard.pData;
            }

            return null;
        }

        MAKE_GENERIC_API(GetBlackboardContent)
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x88)]
    public struct PlayerTargetService
    {
        [FieldOffset(0)]    public GameService.Data Base;

        [FieldOffset(0x68)] public ObjectMoveArray<Memory.Pointer<PlayerTargetComponent>> PlayerTargetComponents;

        public PlayerTargetComponent* GetTargetComponent(string in_componentName)
        {
            foreach (var pPlayerTargetComponent in PlayerTargetComponents)
            {
                if (pPlayerTargetComponent.pData->GetName()() == in_componentName)
                    return pPlayerTargetComponent.pData;
            }

            return null;
        }

        MAKE_GENERIC_API(GetTargetComponent)
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xC0, Pack = 0x20)]
    public struct StageInfo
    {
        [FieldOffset(0)]    public GameService.Data Base;

        [FieldOffset(0x60)] public ObjectMoveArray<StageData> Stages;

        [StructLayout(LayoutKind.Explicit, Size = 0x1F0, Pack = 0x10)]
        public struct StageData
        {
            [FieldOffset(0x18)]  public fixed byte Name[8];

            [FieldOffset(0x38)]  public fixed byte BgmName[32];

            [FieldOffset(0x58)]  public fixed byte SceneParamName[32];

            [FieldOffset(0x78)]  public float BgmRetryStart;

            [FieldOffset(0x7C)]  public float BgmRetryFade;

            [FieldOffset(0x80)]  public int StageIndex;

            [FieldOffset(0x84)]  public int Category;

            [FieldOffset(0x88)]  public int SequenceIndex;

            [FieldOffset(0x8E)]  public EPlayerType PlayerType;

            [FieldOffset(0x8C)]  public short AttributeFlags;

            [FieldOffset(0x90)]  public int StaticSectorCount;

            [FieldOffset(0x94)]  public byte* pStaticSectors;

            [FieldOffset(0xF8)]  public int DynamicSectorCount;

            [FieldOffset(0xFC)]  public byte* pDynamicSectors;

            [FieldOffset(0x1E8)] public EChunkType ChunkType;

            public enum EPlayerType : byte
            {
                Sonic,
                Buddy,
                Tag,
                Classic,
                Shadow = 5
            }

            public enum EChunkType : byte
            {
                Initial,
                After
            }

            public override string ToString()
            {
                fixed (byte* pName = Name)
                    return Encoding.UTF8.GetString(pName, 8).Trim('\0');
            }
        }
    }
}
Library "Cameras" by "Hyper"
{
    #include "Helpers" noemit

    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of a wrapper for storing instances of `app_cmn::camera::CameraController` in arrays.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct CameraControllerWrapper
    {
        /// <summary>
        /// A pointer to an instance of `app_cmn::camera::CameraController`.
        /// </summary>
        [FieldOffset(0)] public CameraController* pCameraController;
    }

    /// <summary>
    /// A struct representation of `app_cmn::camera::CameraController`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x90)]
    public struct CameraController
    {
        /// <summary>
        /// The position of the camera.
        /// </summary>
        [FieldOffset(0x20)] public Vector3 Position;

        VFUNCTION_PTR(CameraController, 1, long, GetName)
    }
}
Library "States" by "Hyper"
{
    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `hh::ut::internal::StateDescImpl`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct StateDescImpl
    {
        [FieldOffset(0)]    public Helpers.UnmanagedString Name;

        [FieldOffset(0x08)] public void* pFactory;

        [FieldOffset(0x10)] public long ParentID;
    }

    /// <summary>
    /// A struct representation of `hh::ut::StateDesc`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct StateDesc
    {
        [FieldOffset(0)]    public long StateID;

        [FieldOffset(0x08)] public StateDescImpl* pDescription;
    }
}
Library "Messages" by "Hyper, Sajid & ĐeäTh"
{
    #include "Helpers" noemit
    
    #import "Allocators"
    
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct Message
    {
        [FieldOffset(0)]    public long pVftable;

        [FieldOffset(0x08)] public int ID;

        [FieldOffset(0x0C)] public int Sender;

        [FieldOffset(0x10)] public int Receiver;

        [FieldOffset(0x14)] public bool IsBroadcasted;

        [FieldOffset(0x18)] public uint Mask = 0xFFFFFFFF;

        public Message(int in_id)
        {
            ID = in_id;
        }

        VFUNCTION_PTR(Message, 0, Message*, Clone, Message* in_pMessage, IAllocator* in_pAllocator)

        VFUNCTION_PTR(Message, 1, Message*, Dtor, Message* in_pMessage, byte a2)
    }
}
Library "Player" by "Hyper"
{
    #include "Helpers" noemit

    #lib "GameManager"
    #lib "GameObject"

    #lib "Sonic"
    #lib "Buddy"

    #import "Blackboards"
    #import "GOComponents"
    #import "Input"
    #import "PlayerTargets"
    #import "Plugins"
    #import "Services"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x208)]
    public struct Data
    {
        [FieldOffset(0)] public GameObject.Data Base;
        
        public PlayerContext* GetContext()
        {
            fixed (Data* pThis = &this)
            {
                var pGOCPlayerHsm = GameObject.GetGOC<GOCPlayerHsm>(&pThis->Base);

                if (pGOCPlayerHsm == null)
                    return null;
                
                return pGOCPlayerHsm->pPlayerContext;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA8)]
    public struct PlayerContext
    {
        [FieldOffset(0x18)] public Data* pPlayer;
        
        [FieldOffset(0x20)] public BlackboardStatus* pBlackboardStatus;

        [FieldOffset(0x38)] public GOCPlayerHsm* pGOCPlayerHsm;
    }
    
    public Data* GetSonicData()
    {
        return (Data*)GameManager.GetGameObject("Sonic");
    }

    public Data* GetClassicSonicData()
    {
        return (Data*)GameManager.GetGameObject("SonicClassic");
    }

    public Data* GetBuddyData()
    {
        return (Data*)GameManager.GetGameObject("Buddy");
    }

    public Data* GetPlayerData()
    {
        var pSonic = GetSonicData();
        var pBuddy = GetBuddyData();

        if (pSonic != null && pBuddy != null)
        {
            // bodge
            if (Player.State.GetCurrentStateID<Sonic.StateID>(pSonic).ToString().Contains("Follow"))
                return pBuddy;

            return pSonic;
        }

        if (pSonic != null)
            return pSonic;

        if (pBuddy != null)
            return pBuddy;

        var pClassicSonic = GetClassicSonicData();

        if (pClassicSonic != null)
            return pClassicSonic;

        return null;
    }

    /////////////////////////////////////////////////////////////////////////////////////////////////////////

    public static class Input
    {
        public static InputComponent* GetInputComponent()
        {
            var pPlayer = GetPlayerData();

            if (pPlayer == null)
                return null;

            var pGOCInput = GameObject.GetGOC<GOCInput>(&pPlayer->Base);

            if (pGOCInput == null)
                return null;

            return pGOCInput->pInputComponent;
        }

        public static EButtonState GetButtonState(EButtonType in_buttonType)
        {
            var pInputComponent = GetInputComponent();

            if (pInputComponent == null)
                return EButtonState.Idle;

            foreach (var binding in pInputComponent->Buttons)
            {
                if (binding.ButtonType == in_buttonType)
                    return binding.ButtonState;
            }

            return EButtonState.Idle;
        }

        public static float GetAnalog(EAxisType in_axisType)
        {
            var pInputComponent = GetInputComponent();

            if (pInputComponent == null)
                return 0.0f;

            foreach (var binding in pInputComponent->Axes)
            {
                if (binding.AxisType == in_axisType)
                    return binding.Value;
            }

            return 0.0f;
        }

        public static bool IsAnalogNeutral()
        {
            return GetAnalog(EAxisType.Horizontal) == 0.0f && GetAnalog(EAxisType.Vertical) == 0.0f;
        }
    }

    /////////////////////////////////////////////////////////////////////////////////////////////////////////
    
    public static class State
    {
        public static T GetCurrentStateID<T>(Data* in_pPlayer)
        {
            if (in_pPlayer == null)
                return default;
            
            var pContext = in_pPlayer->GetContext();

            if (pContext == null)
                return default;

            var pGOCPlayerHsm = pContext->pGOCPlayerHsm;

            if (pGOCPlayerHsm == null)
                return default;

            return (T)(object)pGOCPlayerHsm->CurrentStateID;
        }

        public static void SetState<T>(Data* in_pPlayer, T in_destination)
        {
            if (in_pPlayer == null)
                return;
            
            var pContext = in_pPlayer->GetContext();

            if (pContext == null)
                return;

            var pGOCPlayerHsm = pContext->pGOCPlayerHsm;

            if (pGOCPlayerHsm == null)
                return;

            pGOCPlayerHsm->DestinationStateID = (int)(object)in_destination;
            pGOCPlayerHsm->StateFlags |= 0x10;
            pGOCPlayerHsm->StateFlags &= 0xDF;
        }

        public static StatePluginBase* GetStatePlugin(Data* in_pPlayer, string in_pluginName)
        {
            if (in_pPlayer == null)
                return null;
            
            var pContext = in_pPlayer->GetContext();

            if (pContext == null)
                return null;
            
            var pStatePluginManager = pContext->pGOCPlayerHsm->pStatePluginManager;

            if (pStatePluginManager == null)
                return null;

            return pStatePluginManager->GetStatePlugin(in_pluginName);
        }

        public static T* GetStatePlugin<T>(Data* in_pPlayer) where T : unmanaged
        {
            var name = Helpers.GetInternalName(typeof(T));
            
            return (T*)GetStatePlugin(in_pPlayer, string.IsNullOrEmpty(name) ? typeof(T).Name : name);
        }
    }

    /////////////////////////////////////////////////////////////////////////////////////////////////////////

    public static class Status
    {
        public static GameObject.Data* GetLockOnTarget()
        {
            var pPlayerTargetService = GameManager.GetService<PlayerTargetService>();

            if (pPlayerTargetService == null)
                return null;
                
            var pHomingTarget = pPlayerTargetService->GetTargetComponent<HomingTarget>();

            if (pHomingTarget == null)
                return null;
                
            // TODO: check if homing reticle is visible.

            return pHomingTarget->GetPriorityTarget();
        }
    }
}
Library "GameObject" by "Hyper, ĐeäTh & Sajid" 
{
    #include "Helpers" noemit

    #import "Collections"
    #import "GOComponents"

    #lib "Helpers"
    #lib "GameManager"
    #lib "Memory"

    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `hh::game::GameObject`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x1C0, Pack = 0x10)]
    public struct Data
    {
        /// <summary>
        /// The flags for this game object.
        /// </summary>
        [FieldOffset(0x18)] public byte Flags;

        /// <summary>
        /// A pointer to an instance of `app::GameManager`.
        /// </summary>
        [FieldOffset(0x40)] public GameManager.Data* pGameManager;

        /// <summary>
        /// An array of pointers to `hh::game::GOComponent` instances.
        /// </summary>
        [FieldOffset(0x50)] public ObjectMoveArray<Memory.Pointer<GOComponent>> Components;

        /// <summary>
        /// The name of this game object.
        /// </summary>
        [FieldOffset(0xB0)] public Helpers.UnmanagedString Name;

        /// <summary>
        /// A pointer to an instance of `hh::game::WorldObjectStatus`.
        /// </summary>
        [FieldOffset(0x1A8)] public WorldObjectStatus* pWorldObjectStatus;

        public override string ToString() => Name.ToString();

        /// <summary>
        /// Destroys this game object.
        /// </summary>
        public void Kill()
        {
            Flags |= 1;
        }
    }

    /// <summary>
    /// A struct representation of `hh::game::WorldObjectStatus`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit)]
    public struct WorldObjectStatus
    {
        [FieldOffset(0x14)] public int Status;
    }

    /// <summary>
    /// Gets an instance of `hh::game::GOComponent` obtained by the input `hh::game::GameObject` instance by name.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    ///     #lib "GameObject"
    /// //
    /// {
    ///     var pSonic = GameManager.GetGameObject("Sonic");
    ///     var pGOCPlayerKinematicParams = GameObject.GetGOC(pSonic, "GOCPlayerKinematicParams");
    /// }
    /// ]]></code>
    /// </example>
    /// <param name="in_pGameObject">An instance of `hh::game::GameObject`.</param>
    /// <param name="in_name">The name of the instance of `hh::game::GOComponent` to find.</param>
    /// <returns>A pointer to an instance of `hh::game::GOComponent`.</returns>
    public GOComponent* GetGOC(Data* in_pGameObject, string in_name)
    {
        if (in_pGameObject == null)
            return null;

        var components = in_pGameObject->Components;

        for (int i = 0; i < components.Length; i++)
        {
            var pComponent = components[i].pData;
            
            if (pComponent->pStaticClass->Name == in_name)
                return pComponent;
        }

        return null;
    }

    public bool TryGetGOC(Data* in_pGameObject, string in_name, GOComponent* out_pGOC)
    {
        out_pGOC = GetGOC(in_pGameObject, in_name);

        if (out_pGOC == null)
            return false;

        return true;
    }

    /// <summary>
    /// Gets an instance of `hh::game::GOComponent` obtained by the input `hh::game::GameObject` instance.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    ///     #lib "GameObject"
    ///     
    ///     #import "GOComponents"
    /// //
    /// {
    ///     var pSonic = GameManager.GetGameObject("Sonic");
    ///     var pGOCPlayerKinematicParams = GameObject.GetGOC<GOCPlayerKinematicParams>(pSonic);
    /// }
    /// ]]></code>
    /// </example>
    /// <param name="in_pGameObject">An instance of `hh::game::GameObject`.</param>
    /// <returns>A pointer to an instance of `hh::game::GOComponent`.</returns>
    public T* GetGOC<T>(Data* in_pGameObject) where T : unmanaged
    {
        var name = Helpers.GetInternalName(typeof(T));
        
        return (T*)(long)GetGOC(in_pGameObject, string.IsNullOrEmpty(name) ? typeof(T).Name : name);
    }

    public bool TryGetGOC<T>(Data* in_pGameObject, out T* out_pGOC) where T : unmanaged
    {
        out_pGOC = GetGOC<T>(in_pGameObject);

        if (out_pGOC == null)
            return false;

        return true;
    }
}
Library "Objects" by "Hyper"
{
    #lib "GameObject"
    #lib "GameObjectSystem"
    #lib "Helpers"

    #import "GOComponents"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x260)]
    public struct ObjDashRing
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1C0)] public DashRingType Type;

        public enum DashRingType : int
        {
            DashRing,
            RainbowRing
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x510, Pack = 0x20)]
    public struct ObjNormalFloor
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1C0)] public Helpers.UnmanagedString InfoName;

        [FieldOffset(0x1E0)] public void* pGOCVisualGeometryInstance;

        [FieldOffset(0x1E8)] public GOCTransform* pGOCTransform;

        [FieldOffset(0x200)] public fixed byte HFrame1[320];

        [FieldOffset(0x340)] public fixed byte HFrame2[320];

        [FieldOffset(0x498)] public void* pResModel;

        [FieldOffset(0x4D8)] public float WaitTime;

        [FieldOffset(0x4E8)] public short Flags;

        [FieldOffset(0x4EA)] public byte UnkByte1;

        [FieldOffset(0x4F0)] public float FallTimeNormalised;

        [FieldOffset(0x4F8)] public float FallTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x230)]
    public struct PlayerCoordinator
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1D0)] public int UILockonCursorHandle;

        public UILockonCursor* GetLockOnCursor()
        {
            return (UILockonCursor*)GameObjectSystem.GetGameObjectFromHandle(UILockonCursorHandle);
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1F0)]
    public struct UILockonCursor
    {
        [FieldOffset(0)] public GameObject.Data Base;
    }
}
Library "GOComponentManager" by "Hyper"
{
    #lib "Memory"
    #lib "HandleManagerBase"

    #import "GameTypes"
    #import "GOComponents"

    using System.Runtime.InteropServices;

    public HandleManagerBase.Data* GetHandleManagerSingleton()
    {
        return *(HandleManagerBase.Data**)0x14240E808;
    }

    public GOComponent* GetGOCFromHandle(int in_handle)
    {
        var manager = GetHandleManagerSingleton();
        
        if (manager == null)
            return null;

        return (GOComponent*)manager->GetObject(in_handle);
    }
}
Library "GameService" by "Hyper" 
{
    #include "Helpers" noemit

    #lib "GameManager"

    #import "Allocators"
    
    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `hh::game::GameService`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x60)]
    public struct Data
    {
        /// <summary>
        /// A pointer to a memory allocator.
        /// </summary>
        [FieldOffset(0x08)] public IAllocator* pAllocator;

        /// <summary>
        /// A pointer to an instance of `app::GameManager`.
        /// </summary>
        [FieldOffset(0x30)] public GameManager.Data* pGameManager;

        /// <summary>
        /// A pointer to an instance of `GameServiceStaticClass`.
        /// </summary>
        [FieldOffset(0x38)] public GameServiceStaticClass* pStaticClass;
    }

    /// <summary>
    /// A struct representation of the static class for storing information about a game service.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct GameServiceStaticClass
    {
        /// <summary>
        /// The name of this game service.
        /// </summary>
        [FieldOffset(0)] public Helpers.UnmanagedString Name;

        public override string ToString() => Name.ToString();
    }
}
Library "Allocators" by "Hyper, Sajid & ĐeäTh"
{
    #include "Helpers" noemit

    /// <summary>
    /// A struct representation of the `csl::fnd::IAllocator` interface.
    /// </summary>
    public struct IAllocator
    {
        /// <summary>
        /// Destroys an instance of an allocator with the `csl::fnd::IAllocator` interface.
        /// </summary>
        /// <param name="in_pThis">The instance to destroy.</param>
        VFUNCTION_PTR(IAllocator, 0, void, Dtor, IAllocator* in_pThis)
        
        /// <summary>
        /// Allocates an amount of memory to be used for a resource.
        /// </summary>
        /// <param name="in_size">The amount of memory to allocate.</param>
        /// <param name="in_alignment">The alignment of the data.</param>
        VFUNCTION_PTR(IAllocator, 1, void*, Alloc, IAllocator* in_pThis, long in_size, int in_alignment)

        /// <summary>
        /// Frees used memory at a location.
        /// </summary>
        /// <param name="in_pMemory">A pointer to the memory to free.</param>
        VFUNCTION_PTR(IAllocator, 2, void, Free, IAllocator* in_pThis, void* in_pMemory)
    }
}
Library "PlayerTargets" by "Hyper"
{
    #include "Helpers" noemit

    #lib "GameObject"
    #lib "GOComponentManager"

    #import "Collections"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0xA0)]
    public struct PlayerTargetComponent
    {
        VFUNCTION_PTR(PlayerTargetComponent, 1, Helpers.UnmanagedString, GetName)
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x990)]
    public struct HomingTarget
    {
        [FieldOffset(0)]    public PlayerTargetComponent Base;

        [FieldOffset(0x48)] public ObjectMoveArray<int> ColliderHandles;

        /// <summary>
        /// Gets the target based on its priority.
        /// The highest priority (0) is the current homing target.
        /// </summary>
        /// <param name="in_isLow">Determines if this function retrieves the lowest priority homing target.</param>
        /// <returns>The homing target at the requested priority.</returns>
        public GameObject.Data* GetPriorityTarget(bool in_isLow = false)
        {
            if (ColliderHandles.Length == 0)
                return null;

            var pGOCCollider = GOComponentManager.GetGOCFromHandle(ColliderHandles[in_isLow ? ColliderHandles.Length - 1 : 0]);

            if (pGOCCollider == null)
                return null;

            return pGOCCollider->pParent;
        }

        /// <summary>
        /// Determines if the input target data belongs to an enemy.
        /// </summary>
        /// <returns>A boolean representation of whether the input target data belongs to an enemy.</returns>
        public bool IsTargetEnemy()
        {
            var pTarget = GetPriorityTarget();
                
            if (pTarget == null)
                return false;

            // Enemies will always use GOCEnemyParameter.
            return GameObject.GetGOC(pTarget, "GOCEnemyParameter") != null;
        }
    }
}
Library "Input" by "Hyper"
{
    #lib "Helpers"
    #lib "Memory"

    #import "Collections"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0xD8, Pack = 0x20)]
    public struct InputComponent
    {
        [FieldOffset(0x20)] public void* pInputManager;

        [FieldOffset(0x28)] public InternalPlayerInput* pInternalPlayerInput;

        [FieldOffset(0x30)] public InputMapSettings* pInputMapSettings;

        [FieldOffset(0x38)] public Helpers.UnmanagedString Name;

        [FieldOffset(0x48)] public void** pInputListener;

        [FieldOffset(0x78)] public ObjectMoveArray<ButtonBinding> Buttons;

        [FieldOffset(0x98)] public ObjectMoveArray<AxisBinding> Axes;

        public override string ToString() => Name.ToString();
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x48, Pack = 0x20)]
    public struct InternalPlayerInput
    {
        [FieldOffset(0x28)] public ObjectMoveArray<Memory.Pointer<InputComponent>> InputComponents;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x68, Pack = 0x20)]
    public struct InputMapSettings
    {
        [FieldOffset(0x18)] public ObjectMoveArray<Memory.Pointer<ActionMapping>> ActionMappings;

        [FieldOffset(0x38)] public ObjectMoveArray<Memory.Pointer<AxisMapping>> AxisMappings;

        public void SetAxisDeadzone(float in_deadZone)
        {
            foreach (var axisMapping in AxisMappings)
            {
                var bindings = axisMapping.pData->Bindings;

                for (int i = 0; i < bindings.Length; i++)
                    bindings[i].Min = in_deadZone;
            }
        }
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct ButtonBinding
    {
        public byte UnknownField1;
        public EButtonType ButtonType;
        public byte UnknownField2;
        public byte UnknownField3;
        public EButtonState ButtonState;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct AxisBinding
    {
        public byte UnknownField1;
        public EAxisType AxisType;
        public byte UnknownField2;
        public byte UnknownField3;
        public float Value;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x80, Pack = 0x20)]
    public struct ActionMapping
    {
        [FieldOffset(0x18)] public short Flags;

        [FieldOffset(0x20)] public Helpers.UnmanagedString Name;

        [FieldOffset(0x30)] public ObjectMoveArray<int> Bindings;

        public override string ToString() => Name.ToString();
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x80, Pack = 0x20)]
    public struct AxisMapping
    {
        [FieldOffset(0x18)] public short Flags;

        [FieldOffset(0x20)] public Helpers.UnmanagedString Name;

        [FieldOffset(0x30)] public ObjectMoveArray<AxisData> Bindings;

        [StructLayout(LayoutKind.Sequential)]
        public struct AxisData
        {
            public int ID;
            public float Max;
            public float Min;
        }

        public override string ToString() => Name.ToString();
    }

    public enum EButtonType : byte
    {
        A,
        A2,
        RT,
        Y,
        B,
        B2,
        X,
        A3,
        LT,
        LB,
        RB,
        X2,
        Up = 21,
        Down,
        Left,
        Right
    }

    public enum EButtonState : byte
    {
        Idle,
        Hold,
        Release = 4,
        Press = 19
    }

    public enum EAxisType : byte
    {
        Vertical,
        Horizontal
    }
}
Library "GameObjectSystem" by "Hyper"
{
    #lib "GameObject"

    #import "Allocators"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x1E0)]
    public struct Data
    {
        [FieldOffset(0x20)] public IAllocator* pPooledAllocator;
    }

    public HandleManagerBase.Data* GetHandleManagerSingleton()
    {
        return *(HandleManagerBase.Data**)0x1420707B8;
    }

    public GameObject.Data* GetGameObjectFromHandle(int in_handle)
    {
        var manager = GetHandleManagerSingleton();
        
        if (manager == null)
            return null;

        return (GameObject.Data*)manager->GetObject(in_handle);
    }
}
Library "HandleManagerBase" by "Sajid & Hyper"
{
    #import "Collections"
    #import "GameTypes"

    using System.Runtime.InteropServices;
    using HandleBase = HandleManagerBase.Handle<GameTypes.RefByHandleObject>;

    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    public struct Data
    {
        [FieldOffset(0x18)] public ObjectMoveArray<HandleTableEntry> HandleTable;

        public RefByHandleObject* GetObject(int id)
        {
            if (!IsHandleValid(id))
                return default;

            id &= 0xFFFF;
            return (RefByHandleObject*)HandleTable[(nint)id].Object;
        }

        public HandleBase GetHandle(int id)
        {
            if (!IsHandleValid(id))
                return default;
            
            id &= 0xFFFF;
            return new HandleBase(ref HandleTable[(nint)id]);
        }

        public Handle<T> GetHandle<T>(int id) where T : unmanaged
        {
            if (!IsHandleValid(id))
                return default;

            id &= 0xFFFF;
            return new Handle<T>(ref HandleTable[(nint)id]);
        }

        public Handle<T> GetHandle<T>(in T obj) where T : unmanaged, IRefByHandleObject
        {
            if (!IsHandleValid(obj.Handle))
                return default;

            var id = obj.Handle & 0xFFFF;
            return new Handle<T>(ref HandleTable[(nint)id]);
        }

        public static bool IsHandleValid(int id)
        {
            unchecked
            {
                return (0xFFFF0000 & id) != 0;
            }
        }
    }

    public struct HandleTableEntry
    {
        public long Handle;
        public void* Object;
    }

    public struct Handle<T> where T : unmanaged
    {
        public long Value;
        public HandleTableEntry* TableEntry;

        public Handle(ref HandleTableEntry entry)
        {
            Value = entry.Handle;
            fixed(HandleTableEntry* pEntry = &entry)
            {
                TableEntry = pEntry;
            }
        }

        public bool IsValid()
        {
            return TableEntry != null && (TableEntry->Handle == Value && TableEntry->Object != null);
        }

        public T* Get()
        {
            return IsValid() ? (T*)TableEntry->Object : null;
        }
    }
}
Library "GameTypes" by "Sajid"
{
    #include "Helpers" noemit

    public struct BaseObject
    {
        public nint VFTable;
    }

    public struct ReferencedObject
    {
        public BaseObject Base;
        public void* Allocator;
        public int Unk1;
        public int RefCount;
    }

    public interface IRefByHandleObject
    {
        int Handle { get; set; }
    }

    public struct RefByHandleObject : IRefByHandleObject
    {
        public ReferencedObject Base;
        public int Handle;

        DEFINE_INTERFACE_PROPERTY(IRefByHandleObject, int, Handle)
        DEFINE_BASE_PROPERTY(void*, Allocator)
        DEFINE_BASE_PROPERTY(int, RefCount)
    }
}
Library "Buddy" by "Hyper"
{
    public enum StateID : int
    {
        Default = -1,
        PlayerStateLevitationFollow = 144,
        StateFollowPassHitWall = 132,
        StateFollowRun = 103,
        StateFollowSideWallRun = 136,
        StateFollowSliding = 118,       // StateFollowSquatRoot
        StateFollowSlidingToStand = 119,
        StateFollowSquat = 117, // StateFollowSquatRoot
        StateFollowSquatRoot = 116,
        StateFollowStand = 102,
        StateFollowStomping = 120,
        StateFollowStompingLand = 121,
        StateFollowWallJump = 124,
        StateFollowWallJumpReady = 123,
        StateFollowWallKick = 139,
        StateFollowWallRun = 134,
        StateFollowWallSideStep = 135,
        StateFollowWallSlip = 137,
        StateFollowWallSlipFall = 138,
        StateFollowUpReel = 126,
        StateFollowBoostTrio = 127,
        StateFollowBoostJumpTrio = 128,
        StateFollowBoostFallTrio = 129,
        StateFollowGadgetAction = 130,
        StateFollowGadgetSpAction = 131,
        StateGetOverStep = 74,
        StateGoal = 44,
        StateGoal2 = 45,
        StateFixedGoal = 46,
        StateGrind = 36,        // StateGrindRoot
        StateGrindDamage = 39,  // StateGrindRoot
        StateGrindDamageAir = 40,       // StateGrindRoot
        StateGrindJump = 37,    // StateGrindRoot
        StateGrindDoubleJump = 38,      // StateGrindRoot
        StateGrindRoot = 35,
        StateGrindStep = 41,
        StateHoldStand = 90,
        StateJump = 6,
        StateJumpBoardLaunch = 95,
        StateDoubleJump = 7,
        StateSpringJump = 20,
        StateSpringJumpHeadLand = 21,
        StateBigSpringJump = 22,
        StateJumpGoingTarget = 86,
        StateKnockedBack = 50,
        StateLaunchAutoRunCannon = 94,
        StateLeftStep = 61,
        StateLeftStepRun = 63,
        PlayerStateLevitation = 143,
        StateParkourLanding = 76,
        StatePathJump = 85,
        StatePinBall = 96,
        StatePipeMove = 92,
        StatePipeOut = 93,
        StatePressDead = 30,
        StateQuickStep = 57,    // StateQuickStepRoot
        StateQuickStepCrash = 60,       // StateQuickStepRoot
        StateQuickStepLeft = 58,        // StateQuickStepRoot
        StateQuickStepRight = 59,       // StateQuickStepRoot
        StateQuickStepRoot = 56,
        StateRightStep = 62,
        StateRightStepRun = 64,
        StateRun = 4,
        StateRunningStart = 83,
        StateSandSlider = 98,
        StateSideWallRun = 73,
        StateSleep = 0,
        StateSlider = 97,
        StateSliding = 16,      // StateSquatRoot
        StateSlidingToStand = 17,
        StateSpinAttack = 9,
        StateSquat = 15,        // StateSquatRoot
        StateSquatRoot = 14,
        StateStagger = 51,
        StateStandRoot = 1,
        StateStand = 2, // StateStandRoot
        StateStandWater = 3,    // StateStandRoot
        StateHoldStart = 89,
        StateChangeSuperSonic = 100,
        StateStomping = 42,
        StateStompingLand = 43,
        StateStraightJump = 48,
        StateSuffocatingDead = 13,
        StateUpDead = 12,
        StateWallCrashDead = 32,
        StateWallJump = 19,
        StateWallJumpReady = 18,
        StateWallKick = 71,
        StateWallRun = 69,
        StateHoldWarp = 88,
        StateHoldWarpStart = 87,
        StateWaterFall = 99,
        StateHomingAttackRoot = 53,
        StateHomingFinished = 55,       // StateHomingAttackRoot
        StateHomingAttack = 54, // StateHomingAttackRoot
        StateFollowHomingAttack = 109,  // StateHomingAttackRoot
        StateFollowHomingAttackFinished = 110,  // StateHomingAttackRoot
        StateBoost = 78,        // StateRun
        StateBoostAir = 79,     // StateRun
        StateBoostJump = 80,
        StateBoostFall = 81,
        StateEventDERSonic = 141,
        StateEventDERBuddy = 142,
        TagStateDoubleJump = 223,
        TagStateFollowDoubleJump = 224,
        TagStateDoubleBoostRoot = 227,
        TagStateDoubleBoostStart = 228, // TagStateDoubleBoostRoot
        TagStateDoubleBoostRun = 229,   // TagStateDoubleBoostRoot
        TagStateDoubleBoostRunWeak = 230,       // TagStateDoubleBoostRoot
        TagStateDoubleBoostJump = 231,  // TagStateDoubleBoostRoot
        TagStateDoubleBoostJumpWeak = 232,      // TagStateDoubleBoostRoot
        TagStateDoubleBoostDamage = 233,        // TagStateDoubleBoostRoot
        TagStateFollowDoubleBoostStart = 234,
        TagStateFollowDoubleBoost = 235,
        TagStateFollowDoubleBoostWeak = 236,
        TagStateFollowDoubleBoostJump = 237,
        TagStateFollowDoubleBoostJumpWeak = 238,
        TagStateFollowDoubleBoostDamage = 239,
        TagStateHomingAttack = 240,     // StateHomingAttackRoot
        TagStateFollowHomingObject = 241,       // StateHomingAttackRoot
        TagStateFollowHomingAttack = 242,       // StateHomingAttackRoot
        TagStateHomingAttackFinished = 243,     // StateHomingAttackRoot
        TagStateFollowHomingAttackFinished = 244,       // StateHomingAttackRoot
        TagStateHomingThrow = 245,      // StateHomingAttackRoot
        TagStateFollowHomingThrow = 246,        // StateHomingAttackRoot
        TagStateHomingThrowFinished = 247,      // StateHomingAttackRoot
        TagStateFollowHomingThrowFinished = 248,        // StateHomingAttackRoot
        TagStateHomingKickWait = 249,   // StateHomingAttackRoot
        TagStateFollowHomingKickWait = 250,     // StateHomingAttackRoot
        TagStateHomingKick = 251,       // StateHomingAttackRoot
        TagStateFollowHomingKick = 252, // StateHomingAttackRoot
        TagStateHomingKickFinished = 253,       // StateHomingAttackRoot
        TagStateFollowHomingKickFinished = 254, // StateHomingAttackRoot
        TagStateRescueBeginBuddy = 255,
        TagStateRescueBeginSonic = 256,
        TagStateRescueMain = 257,
        TagStateRescueSub = 258,
        BuddyStateWireRoot = 158,
        BuddyStateWireShoot = 159,      // BuddyStateWireRoot
        BuddyStateWirePull = 160,       // BuddyStateWireRoot
        BuddyStateWireAttack = 161,     // BuddyStateWireRoot
        BuddyStateTrioWireAttack = 162, // BuddyStateWireRoot
        BuddyStateWireTrapezeShoot = 163,
        BuddyStateWireTrapeze = 164,
        BuddyStateWireTrapezePath = 165,
        BuddyStateWireTrapezeAuto = 166,
        BuddyStateWireLaunchShoot = 167,
        BuddyStateWireLaunchAir = 168,
        BuddyStateWireTrack = 169,
        BuddyStateWireGiantSwingShoot = 170,
        BuddyStateWireGiantSwing = 171,
        BuddyStateWireTurn = 172,
        BuddyStateWireTurnPath = 173,
        BuddyStateWireDrift = 174,
        BuddyStateHangtime = 175,
        BuddyStateFollowBoost = 176,
        BuddyStateFollowBoostAir = 177,
        BuddyStateFollowBoostFall = 178,
        BuddyStateGadgetActivated = 179,
        BuddyStateGadgetBurstStand = 180,       // StateStandRoot
        BuddyStateGadgetBurstRun = 181, // StateRun
        BuddyStateGadgetBurstAir = 182, // StateJump
        BuddyStateGadgetBurstAirDouble = 183,   // StateDoubleJump
        BuddyStateGadgetBurstFall = 184,        // StateFall
        BuddyStateGadgetBurstJump = 185,
        BuddyStateGadgetBurstJumpFall = 186,    // StateFall
        BuddyStateGadgetLightningAttack = 187,
        BuddyStateGadgetLightningAttackStand = 188,     // BuddyStateGadgetLightningAttack
        BuddyStateGadgetLightningAttackDash = 189,      // BuddyStateGadgetLightningAttack
        BuddyStateGadgetLightningCharge = 190,
        BuddyStateGadgetLightningChargeAttack = 191,
        BuddyStateGadgetLightningChain = 192,
        BuddyStateGadgetDrillDash = 193,
        BuddyStateGadgetDrillBoost = 194,
        BuddyStateGadgetCubeAttack = 195,
        BuddyStateGadgetCubeAttackAir = 196,
        BuddyStateGadgetCubeSPAttack = 198,
        BuddyStateGadgetCubeSPAttackAir = 199,
        BuddyStateGadgetCubeSPFailed = 200,
        BuddyStateGadgetHoverAttack = 201,
        BuddyStateGadgetHoverJump = 202,
        BuddyStateGadgetHoverFloating = 203,
        BuddyStateGadgetHoverRescue = 204,
        BuddyStateGadgetHoverSliderRescue = 205,
        BuddyStateGadgetVoidAttack = 206,
        BuddyStateGadgetVoidSPAttackStart = 207,
        BuddyStateGadgetVoidSPAttackEnd = 208,
        BuddyStateGadgetVoidJumpFall = 209,     // StateFall
        BuddyStateGadgetVoidAir = 210,
        BuddyStateGadgetVoidAirFall = 211,      // StateFall
        BuddyStateGadgetAsteroidShoot = 212,
        BuddyStateGiantCrabRunaway = 213,
        BuddyStateChangeFriend = 214,
        TrioStateTripleBoostBuddy = 215,
        TrioStateTripleBoostBuddyFailed = 216,
        StateAutoJump = 84,
        StateBallMove = 47,
        StateBlowDead = 31,
        StateBlown = 49,
        StateBrake = 5,
        StateBreathe = 34,
        StateCaught = 91,
        StateCeilingRun = 77,
        StateClassicDead = 33,
        StateClimbWall = 75,
        StateDamage = 23,
        StateDamageAir = 24,
        StateDamageQuake = 28,
        StateDamageRunning = 25,
        StateDead = 29,
        StateDiving = 66,       // StateDivingRoot
        StateDivingDamage = 68, // StateDivingRoot
        StateDivingFall = 67,   // StateDivingRoot
        StateDivingRoot = 65,
        StateReturnSuperSonic = 101,
        StateFall = 10,
        StateFallingDead = 11,
        StateFallSlope = 52,
        StateFan = 82,
        StateFollowBrake = 104,
        StateFollowCancelStep = 140,
        StateFollowClimbWall = 133,
        StateFollowDiving = 111,
        StateFollowDead = 108,
        StateFollowDrill = 125,
        StateFollowFall = 107,
        StateFollowGrind = 112,
        StateFollowGrindJump = 113,
        StateFollowJump = 105,
        StateFollowJumpBoard = 115,
        StateFollowDoubleJump = 106,
        StateFollowSpring = 114,
        StateFollowKnockedBack = 122,
    }
}
Library "GameManager" by "Hyper, ĐeäTh & Sajid" 
{
    #include "Helpers" noemit

    #lib "GameObject"
    #lib "GameService"
    #lib "Memory"
    
    #import "Allocators"
    #import "Collections"

    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `hh::game::GameManager`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x358)]
    public struct Data
    {
        /// <summary>
        /// An array of pointers to `hh::game::GameObject` instances.
        /// </summary>
        [FieldOffset(0x128)] public ObjectMoveArray<Memory.Pointer<GameObject.Data>> GameObjects;

        /// <summary>
        /// An array of pointers to `hh::game::GameService` instances.
        /// </summary>
        [FieldOffset(0x148)] public ObjectMoveArray<Memory.Pointer<GameService.Data>> GameServices;
    }

    /// <summary>
    /// Gets an instance of `hh::game::GameManager`.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    /// //
    /// {
    ///     var pGameManager = GameManager.Get();
    /// }
    /// ]]></code>
    /// </example>
    /// <returns>A pointer to an instance of `hh::game::GameManager`.</returns>
    public Data* GetSingleton()
    {
        /* 0x140C478D8 */
        long sigGameManagerSingleton = (long)ScanSignature
        (
            "\x48\x89\x2D\xCC\xCC\xCC\xCC\x8D\x75\x20",
            "xxx????xxx"
        );

        if (sigGameManagerSingleton == 0)
            return null;
        
        return *(Data**)Memory.ReadEffectiveAddress(sigGameManagerSingleton);
    }

    /// <summary>
    /// Gets an instance of `hh::game::GameService` obtained by the current instance of `hh::game::GameManager` by name.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    /// //
    /// {
    ///     var pPhotoModeService = GameManager.GetService("PhotoModeService");
    /// }
    /// ]]></code>
    /// </example>
    /// <param name="in_name">The name of the instance of `hh::game::GameService` to find.</param>
    /// <returns>A pointer to an instance of `hh::game::GameService`.</returns>
    public GameService.Data* GetService(string in_name)
    {
        var pGameManager = GetSingleton();

        if (pGameManager == null)
            return null;
        
        var gameServices = pGameManager->GameServices;

        for (int i = 0; i < gameServices.Length; i++)
        {
            var pGameService = gameServices[i].pData;
            
            if (pGameService->pStaticClass->Name == in_name)
                return pGameService;
        }

        return null;
    }

    /// <summary>
    /// Gets an instance of `hh::game::GameService` obtained by the current instance of `hh::game::GameManager`.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    ///     
    ///     #import "Services"
    /// //
    /// {
    ///     var pExpManager = GameManager.GetService<ExpManager>();
    /// }
    /// ]]></code>
    /// </example>
    /// <returns>A pointer to an instance of `hh::game::GameService`.</returns>
    public T* GetService<T>() where T : unmanaged
    {
        var name = Helpers.GetInternalName(typeof(T));
        
        return (T*)GetService(string.IsNullOrEmpty(name) ? typeof(T).Name : name);
    }

    /// <summary>
    /// Gets an instance of `hh::game::GameObject` obtained by the current instance of `hh::game::GameManager` by name.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    /// //
    /// {
    ///     var pSonic = GameManager.GetGameObject("Sonic");
    /// }
    /// ]]></code>
    /// </example>
    /// <param name="in_name">The name of the instance of `hh::game::GameObject` to find.</param>
    /// <returns>A pointer to an instance of `hh::game::GameObject`.</returns>
    public GameObject.Data* GetGameObject(string in_name)
    {
        var pGameManager = GetSingleton();

        if (pGameManager == null)
            return null;
        
        var gameObjects = pGameManager->GameObjects;

        for (int i = 0; i < gameObjects.Length; i++)
        {
            var pGameObject = gameObjects[i].pData;

            if (pGameObject->Name == in_name)
                return pGameObject;
        }

        return null;
    }

    /// <summary>
    /// Gets an instance of `hh::game::GameObject` obtained by the current instance of `hh::game::GameManager`.
    /// </summary>
    /// <example>
    /// <code><![CDATA[
    /// Code
    /// //
    ///     #lib "GameManager"
    ///     
    ///     #import "Objects"
    /// //
    /// {
    ///     var pSonic = GameManager.GetGameObject<Sonic>("Sonic");
    /// }
    /// ]]></code>
    /// </example>
    /// <returns>A pointer to an instance of `hh::game::GameObject`.</returns>
    public T* GetGameObject<T>() where T : unmanaged
    {
        var name = Helpers.GetInternalName(typeof(T));
        
        return (T*)GetGameObject(string.IsNullOrEmpty(name) ? typeof(T).Name : name);
    }
}
Library "Blackboards" by "Hyper"
{
    #include "Helpers" noemit

    #lib "Memory"

    #import "Collections"

    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `app::player::BlackboardContent`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct BlackboardContent
    {
        VFUNCTION_PTR(BlackboardContent, 1, Helpers.UnmanagedString, GetName)
    }

    /// <summary>
    /// A struct representation of `app::player::Blackboard2`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public struct Blackboard2
    {
        [FieldOffset(0x18)] public ObjectMoveArray<Memory.Pointer<BlackboardContent>> Blackboards;
    }

    /// <summary>
    /// A struct representation of `app::player::BlackboardBoost`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    public struct BlackboardBoost
    {
        [FieldOffset(0x18)] public float BoostAmount;

        [FieldOffset(0x24)] public float DoubleBoostAmount;
    }

    /// <summary>
    /// A struct representation of `app::player::BlackboardItem`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct BlackboardItem
    {
        [FieldOffset(0x1C)] public int RingCount;
    }

    /// <summary>
    /// A struct representation of `app::player::BlackboardStatus`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x170)]
    public struct BlackboardStatus
    {
        [FieldOffset(0x28)] public BitSet8 WorldFlags;

        [FieldOffset(0x30)] public bool IsSideView;
    }

    public enum WorldFlags
    {
        IsDead = 5
    }
}
Library "PlayerCollision" by "Hyper"
{
    #import "Collections"

    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x1870, Pack = 0x20)]
    public struct Data
    {
        [FieldOffset(0x40)] public ObjectMoveArray<Raycast> Raycasts;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct Raycast
    {
        [FieldOffset(0)]    public Vector3 Normal;

        [FieldOffset(0x10)] public Vector3 Position;

        [FieldOffset(0x20)] public fixed int Flags[3];
    }
}
Library "Sonic" by "Hyper"
{
    public enum StateID : int
    {
        Default = -1,
        StateAutoJump = 84,
        StateBallMove = 47,
        StateBlowDead = 31,
        StateBlown = 49,
        StateBrake = 5,
        StateBreathe = 34,
        StateCaught = 91,
        StateCeilingRun = 77,
        StateClassicDead = 33,
        StateClimbWall = 75,
        StateDamage = 23,
        StateDamageAir = 24,
        StateDamageQuake = 28,
        StateDamageRunning = 25,
        StateDead = 29,
        StateDiving = 66,       // StateDivingRoot
        StateDivingDamage = 68, // StateDivingRoot
        StateDivingFall = 67,   // StateDivingRoot
        StateDivingRoot = 65,
        StateReturnSuperSonic = 101,
        StateFall = 10,
        StateFallingDead = 11,
        StateFallSlope = 52,
        StateFan = 82,
        StateFollowBrake = 104,
        StateFollowCancelStep = 140,
        StateFollowClimbWall = 133,
        StateFollowDiving = 111,
        StateFollowDead = 108,
        StateFollowDrill = 125,
        StateFollowFall = 107,
        StateFollowGrind = 112,
        StateFollowGrindJump = 113,
        StateFollowJump = 105,
        StateFollowJumpBoard = 115,
        StateFollowDoubleJump = 106,
        StateFollowSpring = 114,
        StateFollowKnockedBack = 122,
        PlayerStateLevitationFollow = 144,
        StateFollowPassHitWall = 132,
        StateFollowRun = 103,
        StateFollowSideWallRun = 136,
        StateFollowSliding = 118,       // StateFollowSquatRoot
        StateFollowSlidingToStand = 119,
        StateFollowSquat = 117, // StateFollowSquatRoot
        StateFollowSquatRoot = 116,
        StateFollowStand = 102,
        StateFollowStomping = 120,
        StateFollowStompingLand = 121,
        StateFollowWallJump = 124,
        StateFollowWallJumpReady = 123,
        StateFollowWallKick = 139,
        StateFollowWallRun = 134,
        StateFollowWallSideStep = 135,
        StateFollowWallSlip = 137,
        StateFollowWallSlipFall = 138,
        StateFollowUpReel = 126,
        StateFollowBoostTrio = 127,
        StateFollowBoostJumpTrio = 128,
        StateFollowBoostFallTrio = 129,
        StateFollowGadgetAction = 130,
        StateFollowGadgetSpAction = 131,
        StateGetOverStep = 74,
        StateGoal = 44,
        StateGoal2 = 45,
        StateFixedGoal = 46,
        StateGrind = 36,        // StateGrindRoot
        StateGrindDamage = 39,  // StateGrindRoot
        StateGrindDamageAir = 40,       // StateGrindRoot
        StateGrindJump = 37,    // StateGrindRoot
        StateGrindDoubleJump = 38,      // StateGrindRoot
        StateGrindRoot = 35,
        StateGrindStep = 41,
        StateHoldStand = 90,
        StateJump = 6,
        StateJumpBoardLaunch = 95,
        StateDoubleJump = 7,
        StateSpringJump = 20,
        StateSpringJumpHeadLand = 21,
        StateBigSpringJump = 22,
        StateJumpGoingTarget = 86,
        StateKnockedBack = 50,
        StateLaunchAutoRunCannon = 94,
        StateLeftStep = 61,
        StateLeftStepRun = 63,
        PlayerStateLevitation = 143,
        StateParkourLanding = 76,
        StatePathJump = 85,
        StatePinBall = 96,
        StatePipeMove = 92,
        StatePipeOut = 93,
        StatePressDead = 30,
        StateQuickStep = 57,    // StateQuickStepRoot
        StateQuickStepCrash = 60,       // StateQuickStepRoot
        StateQuickStepLeft = 58,        // StateQuickStepRoot
        StateQuickStepRight = 59,       // StateQuickStepRoot
        StateQuickStepRoot = 56,
        StateRightStep = 62,
        StateRightStepRun = 64,
        StateRun = 4,
        StateRunningStart = 83,
        StateSandSlider = 98,
        StateSideWallRun = 73,
        StateSleep = 0,
        StateSlider = 97,
        StateSliding = 16,      // StateSquatRoot
        StateSlidingToStand = 17,
        StateSpinAttack = 9,
        StateSquat = 15,        // StateSquatRoot
        StateSquatRoot = 14,
        StateStagger = 51,
        StateStandRoot = 1,
        StateStand = 2, // StateStandRoot
        StateStandWater = 3,    // StateStandRoot
        StateHoldStart = 89,
        StateChangeSuperSonic = 100,
        StateStomping = 42,
        StateStompingLand = 43,
        StateStraightJump = 48,
        StateSuffocatingDead = 13,
        StateUpDead = 12,
        StateWallCrashDead = 32,
        StateWallJump = 19,
        StateWallJumpReady = 18,
        StateWallKick = 71,
        StateWallRun = 69,
        StateHoldWarp = 88,
        StateHoldWarpStart = 87,
        StateWaterFall = 99,
        StateHomingAttackRoot = 53,
        StateHomingFinished = 55,       // StateHomingAttackRoot
        StateHomingAttack = 54, // StateHomingAttackRoot
        StateFollowHomingAttack = 109,  // StateHomingAttackRoot
        StateFollowHomingAttackFinished = 110,  // StateHomingAttackRoot
        StateBoost = 78,        // StateRun
        StateBoostAir = 79,     // StateRun
        StateBoostJump = 80,
        StateBoostFall = 81,
        StateEventDERSonic = 141,
        StateEventDERBuddy = 142,
        TagStateDoubleJump = 223,
        TagStateFollowDoubleJump = 224,
        TagStateDoubleBoostRoot = 227,
        TagStateDoubleBoostStart = 228, // TagStateDoubleBoostRoot
        TagStateDoubleBoostRun = 229,   // TagStateDoubleBoostRoot
        TagStateDoubleBoostRunWeak = 230,       // TagStateDoubleBoostRoot
        TagStateDoubleBoostJump = 231,  // TagStateDoubleBoostRoot
        TagStateDoubleBoostJumpWeak = 232,      // TagStateDoubleBoostRoot
        TagStateDoubleBoostDamage = 233,        // TagStateDoubleBoostRoot
        TagStateFollowDoubleBoostStart = 234,
        TagStateFollowDoubleBoost = 235,
        TagStateFollowDoubleBoostWeak = 236,
        TagStateFollowDoubleBoostJump = 237,
        TagStateFollowDoubleBoostJumpWeak = 238,
        TagStateFollowDoubleBoostDamage = 239,
        TagStateHomingAttack = 240,     // StateHomingAttackRoot
        TagStateFollowHomingObject = 241,       // StateHomingAttackRoot
        TagStateFollowHomingAttack = 242,       // StateHomingAttackRoot
        TagStateHomingAttackFinished = 243,     // StateHomingAttackRoot
        TagStateFollowHomingAttackFinished = 244,       // StateHomingAttackRoot
        TagStateHomingThrow = 245,      // StateHomingAttackRoot
        TagStateFollowHomingThrow = 246,        // StateHomingAttackRoot
        TagStateHomingThrowFinished = 247,      // StateHomingAttackRoot
        TagStateFollowHomingThrowFinished = 248,        // StateHomingAttackRoot
        TagStateHomingKickWait = 249,   // StateHomingAttackRoot
        TagStateFollowHomingKickWait = 250,     // StateHomingAttackRoot
        TagStateHomingKick = 251,       // StateHomingAttackRoot
        TagStateFollowHomingKick = 252, // StateHomingAttackRoot
        TagStateHomingKickFinished = 253,       // StateHomingAttackRoot
        TagStateFollowHomingKickFinished = 254, // StateHomingAttackRoot
        TagStateRescueBeginBuddy = 255,
        TagStateRescueBeginSonic = 256,
        TagStateRescueMain = 257,
        TagStateRescueSub = 258,
        SonicStateFollowWireTrack = 148,
        SonicStateFollowWireLaunch = 147,
        SonicStateFollowWireGiantSwing = 149,
        SonicStateFollowWireTurn = 150,
        SonicStateFollowWireDrift = 151,
        TagStateFollowWireBoostBegin = 152,
        SonicStateFollowGadgetHoverJump = 153,
        SonicStateFollowGadgetHoverFloating = 154,
        SonicStateFollowGadgetHoverRescue = 155,
        TrioStateTripleBoost = 156,
        TrioStateTripleBoostFailed = 157,
    }
}
Library "Plugins" by "Hyper"
{
    #include "Helpers" noemit

    #lib "Helpers"

    #import "Collections"

    using System.Runtime.InteropServices;

    /// <summary>
    /// A struct representation of `app::player::StatePluginBase`.
    /// </summary>
    [StructLayout(LayoutKind.Sequential, Size = 0x28)]
    public struct StatePluginBase
    {
        VFUNCTION_PTR(StatePluginBase, 1, Helpers.UnmanagedString, GetName)
    }

    /// <summary>
    /// A struct representation of `app::player::StatePlugin<T>`.
    /// </summary>
    [StructLayout(LayoutKind.Sequential, Size = 0x28)]
    public struct StatePlugin
    {
        public StatePluginBase Base;
    }

    /// <summary>
    /// A struct representation of `app::player::PlayerStatePlugin`.
    /// </summary>
    [StructLayout(LayoutKind.Sequential, Size = 0x28)]
    public struct PlayerStatePlugin
    {
        public StatePlugin Base;
    }

    /// <summary>
    /// A struct representation of `app::player::StatePluginManager`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x48)]
    public struct StatePluginManager
    {
        /// <summary>
        /// An array of pointers to `app::player::StatePluginBase` instances.
        /// </summary>
        [FieldOffset(0x20)] public ObjectMoveArray<Memory.Pointer<StatePluginBase>> Plugins;

        /// <summary>
        /// Gets an instance of `app::player::StatePluginBase` by name.
        /// </summary>
        /// <param name="in_pluginName">The name of the state plugin.</param>
        /// <returns>An instance of `app::player::StatePluginBase` requested by name.</returns>
        public StatePluginBase* GetStatePlugin(string in_pluginName)
        {
            foreach (var pPlugin in Plugins)
            {
                if (pPlugin.pData == null)
                    continue;

                if (pPlugin.pData->GetName()() == in_pluginName)
                    return pPlugin.pData;
            }

            return null;
        }

        MAKE_GENERIC_API(GetStatePlugin)
    }

    /// <summary>
    /// A struct representation of `app::player::StatePluginAutoRun`.
    /// </summary>
    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public struct StatePluginAutoRun
    {
        [FieldOffset(0x30)] public float Speed;
    }
}
Library "Collections" by "Sajid & Hyper" does "Provides extended collection types."
{
    #import "Allocators"

    using System.Collections;
    using System.Collections.Generic;
    using System.Linq;
    using System.Runtime.InteropServices;
    using System.Text;

    #define MAKE_BITSET_TYPE(NAME, TYPE) \
        public struct NAME \
        { \
            public TYPE Value; \
\
            public void Reset() \
            { \
                Value = 0; \
            } \
\
            public void Reset(TYPE in_bitIndex) \
            { \
                Value &= (TYPE)(~((TYPE)1 << (int)in_bitIndex)); \
            } \
\
            public void Flip(TYPE in_bitIndex) \
            { \
                Value ^= (TYPE)(((TYPE)1 << (int)in_bitIndex)); \
            } \
\
            public void Set() \
            { \
                Value = TYPE.MaxValue; \
            } \
\
            public void Set(TYPE in_bitIndex) \
