Library "Objects" by "Hyper"
{
    #lib "GameObject"
    #lib "GameObjectSystem"
    #lib "Helpers"

    #import "GOComponents"

    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x260)]
    public struct ObjDashRing
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1C0)] public DashRingType Type;

        public enum DashRingType : int
        {
            DashRing,
            RainbowRing
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x510, Pack = 0x20)]
    public struct ObjNormalFloor
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1C0)] public Helpers.UnmanagedString InfoName;

        [FieldOffset(0x1E0)] public void* pGOCVisualGeometryInstance;

        [FieldOffset(0x1E8)] public GOCTransform* pGOCTransform;

        [FieldOffset(0x200)] public fixed byte HFrame1[320];

        [FieldOffset(0x340)] public fixed byte HFrame2[320];

        [FieldOffset(0x498)] public void* pResModel;

        [FieldOffset(0x4D8)] public float WaitTime;

        [FieldOffset(0x4E8)] public short Flags;

        [FieldOffset(0x4EA)] public byte UnkByte1;

        [FieldOffset(0x4F0)] public float FallTimeNormalised;

        [FieldOffset(0x4F8)] public float FallTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x230)]
    public struct PlayerCoordinator
    {
        [FieldOffset(0)]     public GameObject.Data Base;

        [FieldOffset(0x1D0)] public int UILockonCursorHandle;

        public UILockonCursor* GetLockOnCursor()
        {
            return (UILockonCursor*)GameObjectSystem.GetGameObjectFromHandle(UILockonCursorHandle);
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1F0)]
    public struct UILockonCursor
    {
        [FieldOffset(0)] public GameObject.Data Base;
    }
}